NguyenHoangTrieu/STM32_WB55_BLE_V2/App/BLE_Gateway/Src/at_command.c
/**
  ******************************************************************************
  * @file    at_command.c
  * @brief   AT Command Parser implementation
  * @author  BLE Gateway
  ******************************************************************************
  */

#include "at_command.h"
#include "ble_device_manager.h"
#include "ble_connection.h"
#include "ble_gatt_client.h"
#include "ble_hci_le.h"
#include "debug_trace.h"
#include "module_system.h"
#include "module_config.h"
#include "module_power.h"
#include "module_mode.h"
#include "main.h"
#include "app_conf.h"
#include "stm32_seq.h"
#include <stdio.h>
#include <string.h>
#include <stdarg.h>

extern UART_HandleTypeDef hlpuart1;

/*============================================================================
 * Constants
 *============================================================================*/
#define AT_RX_TIMEOUT_MS    500U
#define AT_MAX_GARBAGE      20U
#define ASCII_SPACE         0x20
#define ASCII_TILDE         0x7E
#define ASCII_CR            0x0D
#define ASCII_LF            0x0A

/*============================================================================
 * AT Command Line Buffer (accessed by ISR)
 *============================================================================*/
static volatile char at_line_buf[AT_CMD_MAX_LEN];
static volatile uint16_t at_line_idx = 0;
static volatile uint8_t at_cmd_ready = 0;
static volatile uint16_t at_garbage_count = 0;

/* Double buffer for safe processing */
static char at_cmd_buf[AT_CMD_MAX_LEN];

/* Simple tick counter for timeout (incremented in ISR) */
static volatile uint32_t at_rx_tick = 0;

/*============================================================================
 * Static Helper Functions
 *============================================================================*/

/**
 * @brief Parse unsigned decimal string to uint16_t
 * @return Parsed value, or 0 if invalid
 */
static uint16_t ParseUInt16(const char *str)
{
    uint32_t val = 0;
    
    if (str == NULL || *str == '\0') {
        return 0;
    }
    
    while (*str >= '0' && *str <= '9') {
        val = val * 10U + (uint32_t)(*str - '0');
        if (val > 0xFFFFU) {
            return 0;  /* Overflow */
        }
        str++;
    }
    
    return (uint16_t)val;
}

/**
 * @brief Parse hex string (with optional 0x) to uint16_t
 * @return Parsed value, or 0 if invalid
 */
static uint16_t ParseUInt16_Hex(const char *str)
{
    uint32_t val = 0;
    
    if (str == NULL || *str == '\0') {
        return 0;
    }
    
    /* Skip 0x or 0X prefix */
    if (str[0] == '0' && (str[1] == 'x' || str[1] == 'X')) {
        str += 2;
    }
    
    while (*str != '\0') {
        char c = *str;
        if (c >= '0' && c <= '9') {
            val = (val << 4) | (c - '0');
        } else if (c >= 'A' && c <= 'F') {
            val = (val << 4) | (c - 'A' + 10);
        } else if (c >= 'a' && c <= 'f') {
            val = (val << 4) | (c - 'a' + 10);
        } else {
            break; /* Stop at non-hex char */
        }
        str++;
    }
    
    return (uint16_t)val;
}

/**
 * @brief Parse unsigned decimal string to uint8_t
 * @return Parsed value, or 0xFF if invalid
 */
static uint8_t ParseUInt8(const char *str)
{
    uint16_t val = 0;
    
    if (str == NULL || *str == '\0') {
        return 0xFF;
    }
    
    while (*str >= '0' && *str <= '9') {
        val = val * 10U + (uint16_t)(*str - '0');
        if (val > 0xFFU) {
            return 0xFF;  /* Overflow */
        }
        str++;
    }
    
    return (uint8_t)val;
}

/**
 * @brief Skip to next comma in string
 * @return Pointer to character after comma, or NULL
 */
static const char* SkipToComma(const char *str)
{
    if (str == NULL) {
        return NULL;
    }
    
    while (*str != '\0' && *str != ',') {
        str++;
    }
    
    if (*str == ',') {
        return str + 1;  /* Skip the comma */
    }
    
    return NULL;
}

/**
 * @brief Parse hex nibble character to value
 * @return 0-15 if valid, 0xFF if invalid
 */
static uint8_t ParseHexNibble(char c)
{
    if (c >= '0' && c <= '9') return (uint8_t)(c - '0');
    if (c >= 'A' && c <= 'F') return (uint8_t)(c - 'A' + 10);
    if (c >= 'a' && c <= 'f') return (uint8_t)(c - 'a' + 10);
    return 0xFF;
}

/**
 * @brief Parse hex string "AABBCC..." to bytes
 * @param hex_str Hex string (must have even length)
 * @param out_bytes Output buffer
 * @param max_len Maximum output buffer size
 * @return Number of bytes parsed, or -1 if error
 */
static int ParseHexString(const char *hex_str, uint8_t *out_bytes, uint16_t max_len)
{
    uint16_t i = 0;
    uint8_t hi, lo;
    
    if (hex_str == NULL || out_bytes == NULL || max_len == 0) {
        return -1;
    }

    size_t hex_len = strlen(hex_str);
    if (hex_len % 2 != 0) {
        return -1; // Odd number of chars
    }
    if (hex_len / 2 > max_len) {
        return -1; // Exceeds buffer size
    }
    
    while (hex_str[0] != '\0' && hex_str[1] != '\0' && i < max_len) {
        hi = ParseHexNibble(hex_str[0]);
        lo = ParseHexNibble(hex_str[1]);
        
        if (hi == 0xFF || lo == 0xFF) {
            return -1;  /* Invalid hex character */
        }
        
        out_bytes[i] = (hi << 4) | lo;
        i++;
        hex_str += 2;
    }
    
    /* Check if there's a remaining unpaired nibble */
    if (hex_str[0] != '\0' && hex_str[1] == '\0') {
        return -1;  /* Odd number of hex characters */
    }
    
    return (int)i;
}

/**
 * @brief Parse MAC string "AA:BB:CC:DD:EE:FF" to bytes
 * @note  Simple parser without sscanf for embedded efficiency
 */
static int ParseMACString(const char *mac_str, uint8_t *mac_bytes)
{
    if (mac_str == NULL || mac_bytes == NULL) {
        return -1;
    }
    
    /* Expected format: "XX:XX:XX:XX:XX:XX" = 17 chars */
    uint8_t i;
    for (i = 0; i < 6U; i++) {
        uint8_t hi, lo;
        char c;
        
        /* High nibble */
        c = mac_str[i * 3U];
        if (c >= '0' && c <= '9')      hi = (uint8_t)(c - '0');
        else if (c >= 'A' && c <= 'F') hi = (uint8_t)(c - 'A' + 10);
        else if (c >= 'a' && c <= 'f') hi = (uint8_t)(c - 'a' + 10);
        else return -1;
        
