NguyenHoangTrieu/STM32_WB55_BLE_V2/App/BLE_Gateway/Src/at_command.c
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_DISC_Handler(uint8_t dev_idx)
{
    BLE_Device_t *dev;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+DISC: dev=%d, hdl=0x%04X", dev_idx, dev->conn_handle);
    
    /* Start service discovery - results will come async via GATT events */
    ret = BLE_GATT_DiscoverAllServices(dev->conn_handle);
    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* OK sent immediately, +SERVICE responses will follow after GATT events */
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_CHARS_Handler(uint8_t dev_idx, uint16_t start_handle, uint16_t end_handle)
{
    BLE_Device_t *dev;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+CHARS: dev=%d, start=0x%04X, end=0x%04X", 
               dev_idx, start_handle, end_handle);
    
    /* Start characteristic discovery - results will come async via GATT events */
    ret = BLE_GATT_DiscoverCharacteristics(dev->conn_handle, start_handle, end_handle);
    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* OK sent immediately, +CHAR responses will follow after GATT events */
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_INFO_Handler(uint8_t dev_idx)
{
    BLE_Device_t *dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (!dev) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+INFO: dev=%d", dev_idx);
    AT_Response_Send("+INFO:%02X:%02X:%02X:%02X:%02X:%02X\r\n",
                   dev->mac_addr[5], dev->mac_addr[4], dev->mac_addr[3],
                   dev->mac_addr[2], dev->mac_addr[1], dev->mac_addr[0]);
    AT_Response_Send("OK\r\n");
    return 0;
}

// ==================== System/Lifecycle Handlers ====================

int AT_RESET_Handler(void)
{
    DEBUG_WARN("AT+RESET");
    AT_Response_Send("OK\r\n");
    
    /* Software reset after delay */
    HAL_Delay(100);
    Module_System_SoftwareReset();
    
    /* Never returns */
    return 0;
}

int AT_HWRESET_Handler(void)
{
    int ret = Module_System_HardwareReset();
    
    if (ret == 0) {
        AT_Response_Send("OK\r\n");
        return 0;
    } else {
        AT_Response_Send("+ERROR:NOT_SUPPORTED\r\n");
        return -1;
    }
}

int AT_FACTORY_Handler(void)
{
    DEBUG_WARN("AT+FACTORY");
    AT_Response_Send("OK\r\n");
    
    /* Factory reset and reboot */
    HAL_Delay(100);
    Module_System_FactoryReset();
    
    /* Never returns */
    return 0;
}

// ==================== Info/Config Handlers ====================

int AT_GETINFO_Handler(void)
{
    char version_buf[64];
    char ble_version_buf[64];
    uint8_t addr_type;
    uint8_t bd_addr[6];
    
    DEBUG_INFO("AT+GETINFO");
    
    /* Get firmware version */
    Module_System_GetVersion(version_buf, sizeof(version_buf));
    AT_Response_Send("+FW:%s\r\n", version_buf);
    
    /* Get BLE stack version */
    Module_System_GetBLEVersion(ble_version_buf, sizeof(ble_version_buf));
    AT_Response_Send("+BLE:%s\r\n", ble_version_buf);
    
    /* Get BD address */
    if (Module_System_GetBDAddr(&addr_type, bd_addr) == 0) {
        AT_Response_Send("+BDADDR:%02X:%02X:%02X:%02X:%02X:%02X\r\n",
                       bd_addr[5], bd_addr[4], bd_addr[3],
                       bd_addr[2], bd_addr[1], bd_addr[0]);
    }
    
    /* Get uptime */
    uint32_t uptime = Module_System_GetUptime();
    AT_Response_Send("+UPTIME:%lu ms\r\n", uptime);
    
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_NAME_Handler(const char *name)
{
    if (name == NULL || name[0] == '\0') {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+NAME: %s", name);
    
    if (Module_Config_SetDeviceName(name) == 0) {
        AT_Response_Send("OK\r\n");
        return 0;
    } else {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
}

int AT_COMM_Handler(uint32_t baud, uint8_t parity, uint8_t stop)
{
    UART_Config_t uart_config;
    
    DEBUG_INFO("AT+COMM: baud=%lu, parity=%d, stop=%d", baud, parity, stop);
    
    uart_config.baud_rate = baud;
    uart_config.parity = parity;
    uart_config.stop_bits = stop;
    uart_config.data_bits = 8;
    
    if (Module_Config_SetUART(&uart_config) == 0) {
        AT_Response_Send("OK\r\n");
        
        /* Apply UART changes after response */
        HAL_Delay(50);
        Module_Config_ApplyUART();
        
        return 0;
    } else {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
}

int AT_RF_Handler(int8_t tx_power, uint16_t scan_interval, uint16_t scan_window)
{
    RF_Config_t rf_config;
    
    DEBUG_INFO("AT+RF: tx=%d dBm, scan_int=%d, scan_win=%d", 
               tx_power, scan_interval, scan_window);
    
    rf_config.tx_power_dbm = tx_power;
    rf_config.scan_interval = scan_interval;
    rf_config.scan_window = scan_window;
    rf_config.conn_interval_min = 0x0018;  /* Keep defaults */
    rf_config.conn_interval_max = 0x0028;
    
    if (Module_Config_SetRF(&rf_config) == 0) {
        /* Apply RF config immediately */
        Module_Config_ApplyRF();
        AT_Response_Send("OK\r\n");
        return 0;
    } else {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
}

int AT_SAVE_Handler(void)
{
    DEBUG_INFO("AT+SAVE");
    
    if (Module_Config_Save() == 0) {
        AT_Response_Send("OK\r\n");
        return 0;
    } else {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
}

// ==================== Mode Handlers ====================

int AT_CMDMODE_Handler(void)
{
    DEBUG_INFO("AT+CMDMODE");
    
    if (Module_Mode_EnterCommand() == 0) {
        AT_Response_Send("OK\r\n");
        return 0;
    } else {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
}

int AT_DATAMODE_Handler(uint8_t dev_idx, uint16_t char_handle)
{
    DEBUG_INFO("AT+DATAMODE: dev=%d, handle=0x%04X", dev_idx, char_handle);
    
    if (Module_Mode_EnterData(dev_idx, char_handle) == 0) {
        AT_Response_Send("OK\r\n");
        return 0;
    } else {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
}

